In [1]:
from pandas import Series, DataFrame

In [2]:
mydata = {'name':['홍길동', '장길산', '임꺽정'], 'addr':['서울', '인천', '서울'],
         'age':[23, 30, 29]}
mydata

{'name': ['홍길동', '장길산', '임꺽정'],
 'addr': ['서울', '인천', '서울'],
 'age': [23, 30, 29]}

In [3]:
df = DataFrame(mydata)
df

  name addr  age
0  홍길동   서울   23
1  장길산   인천   30
2  임꺽정   서울   29

In [4]:
#컬럼명 순서 변경 / 인덱스 설정
df2 = DataFrame(mydata, columns = ['name', 'age', 'addr'],
         index = ['no.1', 'no.2', 'no.3'])
df2

     name  age addr
no.1  홍길동   23   서울
no.2  장길산   30   인천
no.3  임꺽정   29   서울

In [5]:
df2.columns

Index(['name', 'age', 'addr'], dtype='object')

In [6]:
df2.index

Index(['no.1', 'no.2', 'no.3'], dtype='object')

In [7]:
df2['gender'] = ['male', 'female', 'male']

In [8]:
df2

     name  age addr  gender
no.1  홍길동   23   서울    male
no.2  장길산   30   인천  female
no.3  임꺽정   29   서울    male

In [9]:
#데이터프레임 접근방식
df2['name']

no.1    홍길동
no.2    장길산
no.3    임꺽정
Name: name, dtype: object

In [10]:
df2.name

no.1    홍길동
no.2    장길산
no.3    임꺽정
Name: name, dtype: object

In [11]:
df2.name['no.2']

'장길산'

In [12]:
df2['name']['no.2']

'장길산'

In [13]:
df2.ix['no.2']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [14]:
df2.name['no.2']='장길연'
df2

<ipython-input-14-ac8c11ff37f3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.name['no.2']='장길연'

     name  age addr  gender
no.1  홍길동   23   서울    male
no.2  장길연   30   인천  female
no.3  임꺽정   29   서울    male

In [16]:
df2.sort_index(ascending=0)

     name  age addr  gender
no.3  임꺽정   29   서울    male
no.2  장길연   30   인천  female
no.1  홍길동   23   서울    male

In [18]:
df2.sort_values(by='age',ascending=0)

     name  age addr  gender
no.2  장길연   30   인천  female
no.3  임꺽정   29   서울    male
no.1  홍길동   23   서울    male